#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/nextbnb/nextbnb/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/nextbnb/nextbnb

[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/do-it-simple/nextbnb/runs/run-QtykqSy3B55YitNX[0m
[0m
Waiting for the plan to start...

Terraform v1.0.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.auth.aws_cognito_user_pool.pool[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cognito_user_pool" "pool" {
      [32m+[0m [0m[1m[0marn[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mauto_verified_attributes[0m[0m   = [
          [32m+[0m [0m"email",
        ]
      [32m+[0m [0m[1m[0mcreation_date[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mcustom_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mdomain[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0memail_verification_message[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0memail_verification_subject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mendpoint[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mestimated_number_of_users[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlast_modified_date[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mmfa_configuration[0m[0m          = "OFF"
      [32m+[0m [0m[1m[0mname[0m[0m                       = "nextbnb-pool"
      [32m+[0m [0m[1m[0msms_verification_message[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m                   = (known after apply)

      [32m+[0m [0madmin_create_user_config {
          [32m+[0m [0m[1m[0mallow_admin_create_user_only[0m[0m = (known after apply)

          [32m+[0m [0minvite_message_template {
              [32m+[0m [0m[1m[0memail_message[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0memail_subject[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msms_message[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mlambda_config {
          [32m+[0m [0m[1m[0mcreate_auth_challenge[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mcustom_message[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mdefine_auth_challenge[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mpost_authentication[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mpost_confirmation[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mpre_authentication[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mpre_sign_up[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0mpre_token_generation[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0muser_migration[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mverify_auth_challenge_response[0m[0m = (known after apply)

          [32m+[0m [0mcustom_email_sender {
              [32m+[0m [0m[1m[0mlambda_arn[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mlambda_version[0m[0m = (known after apply)
            }

          [32m+[0m [0mcustom_sms_sender {
              [32m+[0m [0m[1m[0mlambda_arn[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mlambda_version[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mpassword_policy {
          [32m+[0m [0m[1m[0mminimum_length[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mrequire_lowercase[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mrequire_numbers[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mrequire_symbols[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mrequire_uppercase[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtemporary_password_validity_days[0m[0m = (known after apply)
        }

      [32m+[0m [0msms_configuration {
          [32m+[0m [0m[1m[0mexternal_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0msns_caller_arn[0m[0m = (known after apply)
        }

      [32m+[0m [0mverification_message_template {
          [32m+[0m [0m[1m[0mdefault_email_option[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0memail_message[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0memail_message_by_link[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0memail_subject[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0memail_subject_by_link[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msms_message[0m[0m           = (known after apply)
        }
    }

[1m  # module.auth.aws_sqs_queue.terraform_queue[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_sqs_queue" "terraform_queue" {
      [32m+[0m [0m[1m[0marn[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mcontent_based_deduplication[0m[0m       = false
      [32m+[0m [0m[1m[0mdeduplication_scope[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdelay_seconds[0m[0m                     = 90
      [32m+[0m [0m[1m[0mfifo_queue[0m[0m                        = false
      [32m+[0m [0m[1m[0mfifo_throughput_limit[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mkms_data_key_reuse_period_seconds[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmax_message_size[0m[0m                  = 2048
      [32m+[0m [0m[1m[0mmessage_retention_seconds[0m[0m         = 86400
      [32m+[0m [0m[1m[0mname[0m[0m                              = "auth-service"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mreceive_wait_time_seconds[0m[0m         = 10
      [32m+[0m [0m[1m[0mredrive_policy[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mvisibility_timeout_seconds[0m[0m        = 30
    }

[1m  # module.networking.aws_default_route_table.nextbnb_public_route_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_default_route_table" "nextbnb_public_route_table" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Name" = "nextbnb-public-route-table"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Name" = "nextbnb-public-route-table"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.networking.aws_internet_gateway.nextbnb_internet_gateway[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_internet_gateway" "nextbnb_internet_gateway" {
      [32m+[0m [0m[1m[0marn[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"Name" = "nextbnb-internet-gateway"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m = {
          [32m+[0m [0m"Name" = "nextbnb-internet-gateway"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m   = (known after apply)
    }

[1m  # module.networking.aws_route_table.nextbnb_private_route_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "nextbnb_private_route_table" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name" = "nextbnb-private-route-table"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"Name" = "nextbnb-private-route-table"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.nextbnb_private_route_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "nextbnb_private_route_table" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.nextbnb_public_route_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "nextbnb_public_route_table" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.networking.aws_subnet.private_subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "private_subnet" {
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = "us-east-1b"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.2.0/24"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                            = {
          [32m+[0m [0m"Name" = "nextbnb-private-subnet"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                        = {
          [32m+[0m [0m"Name" = "nextbnb-private-subnet"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                          = (known after apply)
    }

[1m  # module.networking.aws_subnet.public_subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "public_subnet" {
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = "us-east-1a"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.1.0/24"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                            = {
          [32m+[0m [0m"Name" = "nextbnb-public-subnet"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                        = {
          [32m+[0m [0m"Name" = "nextbnb-public-subnet"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                          = (known after apply)
    }

[1m  # module.networking.aws_vpc.nextbnb_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_vpc" "nextbnb_vpc" {
      [32m+[0m [0m[1m[0marn[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0massign_generated_ipv6_cidr_block[0m[0m = false
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                       = "10.0.0.0/16"
      [32m+[0m [0m[1m[0mdefault_network_acl_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_security_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mdhcp_options_id[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0menable_classiclink[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0menable_classiclink_dns_support[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0menable_dns_hostnames[0m[0m             = true
      [32m+[0m [0m[1m[0menable_dns_support[0m[0m               = true
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0minstance_tenancy[0m[0m                 = "default"
      [32m+[0m [0m[1m[0mipv6_association_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmain_route_table_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                             = {
          [32m+[0m [0m"Name" = "nextbnb-vpc"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                         = {
          [32m+[0m [0m"Name" = "nextbnb-vpc"
        }
    }

[1m  # module.services.aws_sqs_queue.terraform_dead_letter_queue[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_sqs_queue" "terraform_dead_letter_queue" {
      [32m+[0m [0m[1m[0marn[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mcontent_based_deduplication[0m[0m       = false
      [32m+[0m [0m[1m[0mdeduplication_scope[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdelay_seconds[0m[0m                     = 90
      [32m+[0m [0m[1m[0mfifo_queue[0m[0m                        = false
      [32m+[0m [0m[1m[0mfifo_throughput_limit[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mkms_data_key_reuse_period_seconds[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmax_message_size[0m[0m                  = 2048
      [32m+[0m [0m[1m[0mmessage_retention_seconds[0m[0m         = 86400
      [32m+[0m [0m[1m[0mname[0m[0m                              = "dead_letter_queue"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mreceive_wait_time_seconds[0m[0m         = 10
      [32m+[0m [0m[1m[0mtags_all[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mvisibility_timeout_seconds[0m[0m        = 30
    }

[0m[1mPlan:[0m 11 to add, 0 to change, 0 to destroy.
[0m

```

</details>

*Pusher: @kokiebisu, Action: `pull_request`*